## Plan Result (staging-staging)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;admin&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;afdverify.admin&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;afdverify.video&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;signalr&#34;]
  * module.hearings-reform.azurerm_dns_cname_record.this[&#34;video&#34;]
  * module.hearings-reform.azurerm_dns_zone.zone
  * module.hearings-reform.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings-reform.azurerm_dns_cname_record.this["admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "admin"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["afdverify.admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.admin"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["afdverify.video"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.video"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["signalr"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "signalr"
      + record              = "vh-infra-core-stg.service.signalr.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_dns_cname_record.this["video"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "video"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.hearings.reform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hearings-reform.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":980,"Program":"tfcmt","SHA1":"","Target":"staging-staging","Vars":{}} -->